# IdeaStatiCa.ConnectionApi.Model.ConCalculationJob

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**JobId** | **Guid** |  | [optional]
**ProjectId** | **Guid** |  | [optional]
**Status** | **ConCalculationJobStatusEnum** |  | [optional]
**ConnectionIds** | **List&lt;int&gt;** |  | [optional]
**ConnectionsCompleted** | **int** |  | [optional]
**CurrentConnectionId** | **int?** |  | [optional]
**Progress** | **double** |  | [optional]
**Message** | **string** |  | [optional]
**CreatedAt** | **DateTime** |  | [optional]
**FinishedAt** | **DateTime?** |  | [optional]
**Results** | **List&lt;ConResultSummary&gt;** |  | [optional]
**Error** | **string** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)